labri-progress/d2dpls/STM32PlatformCode/Firmware/SubGHz_Phy/App/subghz_phy_app.c
  // moments when trigger signal shall be sent
  switch (next_state) {
  /* starting a new keygen. the check on probe_cnt is to prevent re-probing due
   * to unsuccessful quantization */
  case PHYSEC_STATE_PROBING:
    if (!trigger_signals.start_signal_sent) {
      trigger_signals.start_signal_sent = true;
      HAL_GPIO_SIGNAL_TRIGGER(TRIGGER_DURATION_CYCLES);
    }
    break;
  case PHYSEC_STATE_KEYGEN:
  case PHYSEC_STATE_POST_KEYGEN_SEND:
  case PHYSEC_STATE_POST_KEYGEN_WAIT:
    if (!trigger_signals.quant_signal_sent) {
      trigger_signals.quant_signal_sent = true;
      HAL_GPIO_SIGNAL_TRIGGER(TRIGGER_DURATION_CYCLES);
    }
    break;
  case PHYSEC_STATE_PRE_RECONCILIATION:
  case PHYSEC_STATE_RECONCILIATION:
    if (!trigger_signals.recon_signal_sent) {
      trigger_signals.recon_signal_sent = true;
      HAL_GPIO_SIGNAL_TRIGGER(TRIGGER_DURATION_CYCLES);
    }
    break;
  case PHYSEC_STATE_KEY_READY:
    if (!trigger_signals.kg_end_signal_sent) {
      trigger_signals.kg_end_signal_sent = true;
      HAL_GPIO_SIGNAL_TRIGGER(TRIGGER_DURATION_CYCLES);
    }
    break;
  }
  physec_state = next_state;
}

char *get_ecc_retval_string(cmox_ecc_retval_t value) {
  switch (value) {
  case CMOX_ECC_SUCCESS:
    return "ECC: Success";
  case CMOX_ECC_ERR_INTERNAL:
    return "ECC: Internal Error";
  case CMOX_ECC_ERR_BAD_PARAMETERS:
    return "ECC: Bad Parameters";
  case CMOX_ECC_ERR_INVALID_PUBKEY:
    return "ECC: Invalid Pubkey";
  case CMOX_ECC_ERR_WRONG_RANDOM:
    return "ECC: Wrong Random";
  case CMOX_ECC_ERR_MEMORY_FAIL:
    return "ECC: Memory Fail";
  case CMOX_ECC_ERR_MATHCURVE_MISMATCH:
    return "ECC: Math Curve Mismatch";
  case CMOX_ECC_ERR_ALGOCURVE_MISMATCH:
    return "ECC: Algo Curve Mismatch";
  default:
    return "ECC: Unknown Error Value";
  }
}

char *get_hash_retval_string(cmox_hash_retval_t value) {
  switch (value) {
  case CMOX_HASH_SUCCESS:
    return "Hash: Success";
  case CMOX_HASH_ERR_INTERNAL:
    return "Hash: Internal Error";
  case CMOX_HASH_ERR_BAD_PARAMETER:
    return "Hash: Bad Parameters";
  case CMOX_HASH_ERR_BAD_OPERATION:
    return "Hash: Bad Operation";
  case CMOX_HASH_ERR_BAD_TAG_SIZE:
    return "Hash: Bad Tag Size";
  default:
    return "Hash: Unknown Error Value";
  }
}

char *get_cipher_retval_string(cmox_cipher_retval_t value) {
  switch (value) {
  case CMOX_CIPHER_SUCCESS:
    return "Cipher: Success";
  case CMOX_CIPHER_ERR_INTERNAL:
    return "Cipher: Internal Error";
  case CMOX_CIPHER_ERR_NOT_IMPLEMENTED:
    return "Cipher: Not Implemented";
  case CMOX_CIPHER_ERR_BAD_PARAMETER:
    return "Cipher: Bad Parameters";
  case CMOX_CIPHER_ERR_BAD_OPERATION:
    return "Cipher: Bad Operation";
  case CMOX_CIPHER_ERR_BAD_INPUT_SIZE:
    return "Cipher: Bad Input Size";
  case CMOX_CIPHER_AUTH_SUCCESS:
    return "Cipher: Auth Success";
  case CMOX_CIPHER_AUTH_FAIL:
    return "Cipher: Auth Failure";
  default:
    return "Cipher: Unknown Error Value";
  }
}

void init_ecdh(void) {
  cmox_ecc_construct(&ecdh_state.ctx.handle, CMOX_MATH_FUNCS_SMALL,
                     ecdh_state.ctx.buffer, ECC_BUFFER_LEN);
  // no need to enable RNG clock as RNG is already supposed initialized
  prng_init(&ecdh_state.ctx.rng, "ECDH", 5);
}

void generate_pub_priv_keys(void) {
  /* first generating a random private key */
  get_random_bytes(ecdh_state.keys.privkey_buffer,
                   CMOX_ECC_CURVE25519_PRIVKEY_LEN, &ecdh_state.ctx.rng);
  /* clamping the private key
   * (https://martin.kleppmann.com/papers/curve25519.pdf, section 4.7) */
  ecdh_state.keys.privkey_buffer[0] &= 0xf8;
  ecdh_state.keys.privkey_buffer[31] &= 0x7f;
  ecdh_state.keys.privkey_buffer[31] |= 0x40;
  /* deriving public key from standard generator base point (0x9) */
  const uint8_t curve25519_base_point[32] = {
      0x09, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
      0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
      0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00};
  /* generating public key from base point and private key */
  size_t pubkey_len = CMOX_ECC_CURVE25519_PUBKEY_LEN;
  cmox_ecc_retval_t keygen_retval =
      cmox_ecdh(&ecdh_state.ctx.handle, CMOX_ECC_CURVE25519,
                ecdh_state.keys.privkey_buffer, CMOX_ECC_CURVE25519_PRIVKEY_LEN,
                curve25519_base_point, sizeof(curve25519_base_point),
                ecdh_state.keys.pubkey_buffer, &pubkey_len);
  if (keygen_retval != CMOX_ECC_SUCCESS) {
    FAIL(get_ecc_retval_string(keygen_retval));
  }
  if (pubkey_len != CMOX_ECC_CURVE25519_PUBKEY_LEN) {
    FAIL("wrong public key length during ecdh key generation");
  }
  tm_send_key_info(KEY_TYPE_ECDH_PUBLIC_PRIVATE_KEYS,
                   ecdh_state.keys.pubkey_buffer,
                   CMOX_ECC_CURVE25519_PUBKEY_LEN * 8);
}

void compute_shared_secret(void) {
  size_t shared_secret_length = CMOX_ECC_CURVE25519_PUBKEY_LEN;
  cmox_ecc_retval_t ecdh_retval = cmox_ecdh(
      &ecdh_state.ctx.handle, CMOX_ECC_CURVE25519,
      ecdh_state.keys.privkey_buffer, CMOX_ECC_CURVE25519_PRIVKEY_LEN,
      ecdh_state.session.peer_public_key, CMOX_ECC_CURVE25519_PUBKEY_LEN,
      ecdh_state.session.shared_secret, &shared_secret_length);
  if (ecdh_retval != CMOX_ECC_SUCCESS) {
    FAIL(get_ecc_retval_string(ecdh_retval));
  }
}

void compute_aes_key_from_shared_secret(void) {
  uint8_t temp_digest_buffer[CMOX_SHA256_SIZE];
  size_t digest_size;
  cmox_hash_retval_t hash_retval =
      cmox_hash_compute(CMOX_SHA256_ALGO, ecdh_state.session.shared_secret,
                        CMOX_ECC_CURVE25519_PUBKEY_LEN, temp_digest_buffer,
                        CMOX_SHA256_SIZE, &digest_size);
  if (hash_retval != CMOX_HASH_SUCCESS) {
    char *retval_message = get_hash_retval_string(hash_retval);
    FAIL(retval_message);
  }
  if (digest_size < AES_KEY_SIZE_IN_BYTES) {
    FAIL("wrong hash size");
  }
  // it is ok to keep the 128 leftmost bits of a sha256 output
  // https://security.stackexchange.com/a/72685
  UTIL_MEM_cpy_8(physec_key, temp_digest_buffer, AES_KEY_SIZE_IN_BYTES);
}

void SubghzApp_Init(void) {
  /* USER CODE BEGIN SubghzApp_Init_1 */
  /* Print APP version*/
  tm_plog(TS_OFF, VLEVEL_M, "APP_VERSION= V%X.%X.%X\r\n",
          (uint8_t)(__APP_VERSION >> __APP_VERSION_MAIN_SHIFT),
          (uint8_t)(__APP_VERSION >> __APP_VERSION_SUB1_SHIFT),
          (uint8_t)(__APP_VERSION >> __APP_VERSION_SUB2_SHIFT));

