labri-progress/d2dpls/STM32PlatformCode/Firmware/SubGHz_Phy/App/subghz_phy_app.c
  /* Led Timers*/
  UTIL_TIMER_Create(&timerLed, 0xFFFFFFFFU, UTIL_TIMER_ONESHOT, OnledEvent,
                    NULL);
  UTIL_TIMER_SetPeriod(&timerLed, LED_PERIOD_MS);
  UTIL_TIMER_Start(&timerLed);
  /* USER CODE END SubghzApp_Init_1 */

  /* Radio initialization */
  RadioEvents.TxDone = OnTxDone;
  RadioEvents.RxDone = OnRxDone;
  RadioEvents.TxTimeout = OnTxTimeout;
  RadioEvents.RxTimeout = OnRxTimeout;
  RadioEvents.RxError = OnRxError;

  Radio.Init(&RadioEvents);

  /*calculate random delay for synchronization*/
  random_delay =
      (Radio.Random()) >> 22; /*10bits random e.g. from 0 to 1023 ms*/

  /* USER CODE BEGIN SubghzApp_Init_2 */
  /* Radio Set frequency */
  Radio.SetChannel(RF_FREQUENCY);

  /* Button initialisation for interuption*/
  USER_BUTTON_GPIO_CLK_ENABLE();
  BSP_PB_Init(BUTTON_USER, BUTTON_MODE_EXTI);

  /* LED initialization */
  LED_Init(LED_RED1);
  LED_Init(LED_RED2);
  LED_Init(LED_BLUE);
  LED_On(LED_BLUE);
  /* GPIO signal initialization */
  HAL_GPIO_SIGNAL_INIT(); // used to signal via GPIO
  /*fills tx buffer*/
  UTIL_MEM_set_8(BufferTx, 0x0, MAX_APP_BUFFER_SIZE);

  // EEPROM read config
  physec_config tmp_conf = {0};

  bool has_config = physec_config_read_eeprom(0, &tmp_conf);
  if (has_config) {
    UTIL_MEM_cpy_8(&physec_conf, &tmp_conf, sizeof(physec_config));
  }

  // for testing quantization without probing
  LED_Off(LED_RED1);
  LED_Off(LED_RED2);
  HAL_UART_SetRxConfig(&huart2, HAL_UART_RxCpltCallback, uart_rx_buf, 1);
  wait_physec_config();

  LED_On(LED_RED1);
  LED_On(LED_RED2);

  // EEPROM save new config
  if (config_done) {
    if (physec_config_write_eeprom(0, &physec_conf) == HAL_OK) {
      tm_plog(TS_OFF, VLEVEL_M,
              "New PHYsec configuration saved in EEPROM !\r\n");
    }
  }

  /* Radio configuration */
#if ((USE_MODEM_LORA == 1) && (USE_MODEM_FSK == 0))
  /* Enable Physical Layer Security features of SX1276 driver */
  Radio.SetPLS(true);
  // tm_plog(TS_OFF, VLEVEL_M, "PLS enabled\n\r");

  Radio.SetTxConfig(MODEM_LORA, physec_conf.physical_layer.lora.power, 0,
                    physec_conf.physical_layer.lora.bw,
                    physec_conf.physical_layer.lora.sf, LORA_CODINGRATE,
                    LORA_PREAMBLE_LENGTH, LORA_FIX_LENGTH_PAYLOAD_ON, true, 0,
                    0, LORA_IQ_INVERSION_ON, TX_TIMEOUT_VALUE);

  Radio.SetRxConfig(MODEM_LORA, physec_conf.physical_layer.lora.bw,
                    physec_conf.physical_layer.lora.sf, LORA_CODINGRATE, 0,
                    LORA_PREAMBLE_LENGTH, LORA_SYMBOL_TIMEOUT,
                    LORA_FIX_LENGTH_PAYLOAD_ON, 0, true, 0, 0,
                    LORA_IQ_INVERSION_ON, true);

  Radio.SetMaxPayloadLength(MODEM_LORA, MAX_APP_BUFFER_SIZE);

#else
#error "Please define a modulation in the subghz_phy_app.h file."
#endif /* USE_MODEM_LORA | USE_MODEM_FSK */

  // log current config
  tm_plog(TS_OFF, VLEVEL_M, "PHYsec configuration window elapsed !\r\n");
  tm_send_keygen_conf();
  tm_plog(TS_OFF, VLEVEL_M, "Role = %s\n\r",
          (physec_conf.keygen.is_master) ? "Master" : "Slave");
  tm_plog(TS_OFF, VLEVEL_M, "Keygen ID = %d (0x%x)\n\r",
          physec_conf.keygen.keygen_id, physec_conf.keygen.keygen_id);
  tm_plog(TS_OFF, VLEVEL_M, "DEBUG: CSI Type = %d\n\r",
          physec_conf.keygen.csi_type);
  tm_plog(TS_OFF, VLEVEL_M, "DEBUG: Quant Type = %d\n\r",
          physec_conf.keygen.quant_type);
  tm_plog(TS_OFF, VLEVEL_M, "DEBUG: Reconciliation Type = %d\n\r",
          physec_conf.keygen.recon_type);
  tm_plog(TS_OFF, VLEVEL_M, "Radio Conf:\n\r");
  tm_plog(TS_OFF, VLEVEL_M, "Modulation = %s\n\r",
          (physec_conf.physical_layer.modulation == PHYSEC_PHY_MODULATION_LORA)
              ? "LORA"
              : "FSK");
  if (physec_conf.physical_layer.modulation == PHYSEC_PHY_MODULATION_LORA) {
    tm_plog(TS_OFF, VLEVEL_M, "- SF = %d\n\r",
            physec_conf.physical_layer.lora.sf);
    tm_plog(TS_OFF, VLEVEL_M, "- BW = %d kHz\n\r",
            (1 << physec_conf.physical_layer.lora.bw) * 125);
    tm_plog(TS_OFF, VLEVEL_M, "- Power = %d dBm\n\r",
            physec_conf.physical_layer.lora.power);
  }

  if (num_csi > 0) {
    // getting to the right number of CSI, as if they were obtained through
    // probing.
    if (physec_conf.keygen.quant_type == QUANT_MBR_LOSSLESS) {
      // first of all we check if it is even possible to quantize
      if (measurements_sufficiency_check_mbr_lossless(csi_measures, num_csi)) {
        // then we find the minimum amount of CSI we need
        bool found_min_num_csi = false;
        for (size_t required_csi = 0;
             required_csi < num_csi && !found_min_num_csi; required_csi++) {
          if (measurements_sufficiency_check_mbr_lossless(csi_measures,
                                                          required_csi)) {
            // we found the minimum number of CSI required
            num_csi = required_csi;
            found_min_num_csi = true;
          }
        }
      }
    }
    probe_cnt = num_csi;
    tm_plog(TS_ON, VLEVEL_M, "CSI INIT:\r\n");
    tm_send_csis(csi_measures, num_csi);
    if (physec_conf.keygen.is_master &&
        pre_process_and_quantize() >= REQUIRED_NUM_BITS_PER_KEY) {
      tm_plog(TS_ON, VLEVEL_M, "> Keygen Done ! (%d bits)\n\r",
              physec_key_num_bits);
      tm_send_key_info(KEY_TYPE_QUANT, physec_key, physec_key_num_bits);
      tm_plog(TS_ON, VLEVEL_L, "Alice's Preliminary Key = [ ");
      for (size_t i = 0; i < AES_KEY_SIZE_IN_BYTES; i++) {
        if (i == AES_KEY_SIZE_IN_BYTES - 1) {
          tm_plog(TS_OFF, VLEVEL_L, "%02x ]\n\r", physec_key[i]);
        } else {
          tm_plog(TS_OFF, VLEVEL_L, "%02x,", physec_key[i]);
        }
      }

      if (QUANT_IS_LOSSY(physec_conf.keygen.quant_type)) {
        update_physec_state(PHYSEC_STATE_POST_KEYGEN_SEND);
      } else {
        update_physec_state(PHYSEC_STATE_KEYGEN);
      }
    }
  }

  /*register task to to be run in while(1) after Radio IT*/
  UTIL_SEQ_RegTask((1 << CFG_SEQ_Task_SubGHz_Phy_App_Process), UTIL_SEQ_RFU,
                   PHYsec_Platform_Process);
  cmox_init(); // init cmox STM32 module
  if (physec_conf.keygen.csi_type == CSI_ECDH ||
      physec_conf.keygen.quant_type == QUANT_ECDH ||
      physec_conf.keygen.recon_type == RECON_ECDH) {
    if (physec_conf.keygen.csi_type != CSI_ECDH ||
        physec_conf.keygen.quant_type != QUANT_ECDH ||
        physec_conf.keygen.recon_type != RECON_ECDH) {
      FAIL("ECDH-oriented pipeline steps are only compatible within each "
           "other.");
    } else {
      init_ecdh();
      ecdh_state.enabled = true;
    }
  }
  if (physec_conf.keygen.recon_type == RECON_FE_STL) {
    fe_stl_init();
  }
  reset_physec_states(true);
  if (physec_conf.keygen.is_master || ecdh_state.enabled) {
    UTIL_SEQ_SetTask((1 << CFG_SEQ_Task_SubGHz_Phy_App_Process),
                     CFG_SEQ_Prio_0);
    State = TX_FIRST_PROBE;
  } else {
    /*starts reception*/
    Radio.Rx(RX_TIMEOUT_VALUE + random_delay);
  }
  /* USER CODE END SubghzApp_Init_2 */
}

/* USER CODE BEGIN EF */

/*!
 *	\brief	Wait for a specific period of time for PHYsec configuration
 *
 *	Abort on timeout expiration or configuration done. Configuration data
 *	is handled and parsed by the UART IRQ.
 */
void wait_physec_config(void) {
  uint32_t start_time = HAL_GetTick();
  while (on_config || HAL_GetTick() - start_time < UART_CONFIG_TIME_WINDOW_MS) {
    __WFI();
    // HAL_Delay(100);
    if (config_done)
      break;
  }
}

/*!
 *	\brief Post process sending of quantization indexes
 *
 *	\param[in] to_send		bitmap of indexes to send
 *
 */
static void post_process_send_indexes(lossy_chunk_bitmap_t to_send) {
  tm_plog(TS_ON, VLEVEL_L, "> PLS - Total indexes: %u\n\r", num_indexes);
  tm_plog(TS_ON, VLEVEL_L, "> PLS - Sending 0x%x\n\r", to_send);
  size_t num_chunks =
      (num_indexes + MAX_LOSSY_PER_RADIO_FRAME - 1) / MAX_LOSSY_PER_RADIO_FRAME;
  if (num_chunks > MAX_LOSSY_CHUNKS)
    num_chunks = MAX_LOSSY_CHUNKS;

  for (size_t i = 0; i < num_chunks; i++) {
    if ((to_send >> i) & 0x1) {
      tm_plog(TS_ON, VLEVEL_L, "> PLS - Sending lossy indexes chunk %u\n\r", i);
      size_t num_indexes_chunk =
          (i == num_chunks - 1) ? (num_indexes - i * MAX_LOSSY_PER_RADIO_FRAME)
                                : MAX_LOSSY_PER_RADIO_FRAME;
      quant_index_t *indexes_chunk = indexes + i * MAX_LOSSY_PER_RADIO_FRAME;
      physec_packet_t *packet = build_keygen_data_packet(
          physec_conf.keygen.keygen_id, i, indexes_chunk, num_indexes_chunk,
          num_indexes, BufferTx, MAX_APP_BUFFER_SIZE);

      Radio.Send((uint8_t *)packet, physec_packet_get_size(packet));

      uint32_t toa = lora_toa(physec_conf.physical_layer.lora.sf,
                              physec_conf.physical_layer.lora.bw,
                              physec_packet_get_size(packet));
      HAL_Delay(Radio.GetWakeupTime() + toa);
    }
  }
}

/*!
 *	\brief Post process receiving of quantization indexes
 *
 *	Merge received indexes with local indexes array in case of Bob. Just
 *copy indexes in case of Alice. This also retrieve the expected number of
 *quantization indexes chunks and updates the received indexes bitmap
 *
 *	\param[in] indexes_pkt		Received indexes packet
 *	\param[in] master			PHYsec Role
 *
 *	\return -1 in case of error (no enough memory, ...), 0 if there is still
 *	chunks to receive, or the total number of chunks to receive if all
 *chunks have been received.
 */
static int post_process_handle_rx_indexes(physec_keygen_data_t *indexes_pkt,
                                          bool master) {
  UNUSED(master);
  if (num_indexes + indexes_pkt->num_dropped > NUM_MAX_QUANT_INDEX) {
    // TODO: truncate or abort
    return -1;
  }
  if (indexes_pkt->dropped_chunk_id >= MAX_LOSSY_CHUNKS) {
    return -1;
  }

  if (indexes_pkt->dropped_chunk_id == 0) {
    post_process_num_chunks_to_rx =
        (MAX_LOSSY_PER_RADIO_FRAME + indexes_pkt->num_dropped - 1) /
        MAX_LOSSY_PER_RADIO_FRAME;
  } else if (post_process_num_chunks_to_rx == 0) {
    // 1st lossy vec not received, deduce total size
    post_process_num_chunks_to_rx =
        indexes_pkt->dropped_chunk_id +
        (MAX_LOSSY_PER_RADIO_FRAME + indexes_pkt->num_dropped - 1) /
            MAX_LOSSY_PER_RADIO_FRAME;
  }
  tm_plog(TS_ON, VLEVEL_L,
          "> PLS - Total lossy indexes to Rx: %u (expected %u chunks)\n\r",
          indexes_pkt->num_dropped, post_process_num_chunks_to_rx);
  tm_plog(TS_ON, VLEVEL_L, "Local num indexes = %u\n\r", num_indexes);

