labri-progress/d2dpls/STM32PlatformCode/Firmware/SubGHz_Phy/App/subghz_phy_app.c
        // Could not receive probe response, try send back probe_req
        send_probe(probe_cnt);
        tm_plog(TS_ON, VLEVEL_M, "< Probe Sent ! (cnt=%u)\n\r", probe_cnt);
        return;

      } else if (quant_status == QUANT_STATUS_FAILURE) {
        // if quantization was requested but failed,
        // then send KeyGen Quant error packet
        physec_packet_t *packet = build_keygen_error_packet(
            physec_conf.keygen.keygen_id, BufferTx, MAX_APP_BUFFER_SIZE);
        Radio.Send((uint8_t *)packet, physec_packet_get_size(packet));
      }
      break;
    }
    case PHYSEC_STATE_KEYGEN: {
      if (ecdh_state.enabled) {
        /* retransmitting the generated key */
        Radio.Send(BufferTx,
                   physec_packet_get_size((physec_packet_t *)BufferTx));
      } else if (physec_conf.keygen.is_master) {
        // Send KeyGen start packet for lossless quant
        // (assuming it was not received by slave)
        physec_packet_t *packet = build_keygen_success_packet_lossless(
            physec_conf.keygen.keygen_id, BufferTx, MAX_APP_BUFFER_SIZE);
        Radio.Send((uint8_t *)packet, physec_packet_get_size(packet));
      }

      break;
    }
    case PHYSEC_STATE_RECONCILIATION: {
      // retransmit current tx buffer !
      // TODO: check if we are always in the case were BufferTx already contains
      // our data

      if (physec_conf.keygen.is_master) {
        Radio.Send(BufferTx,
                   physec_packet_get_size((physec_packet_t *)BufferTx));
      } else {
        Radio.Send(BufferTx,
                   physec_packet_get_size((physec_packet_t *)BufferTx));
      }
      break;
    }
    case PHYSEC_STATE_KEY_READY: {
      if (!physec_conf.keygen.is_master)
        break;
      tm_plog(TS_ON, VLEVEL_L, "> Sending encrypted packet\n\r");

      uint8_t msg[sizeof(SECRET_MSG) + 1] = {0};
      UTIL_MEM_cpy_8(msg, SECRET_MSG, sizeof(SECRET_MSG));
      vigenere_encrypt_decrypt(msg, sizeof(SECRET_MSG), physec_key,
                               AES_KEY_SIZE_IN_BYTES);
      physec_packet_t *packet = build_encrypted_packet(
          physec_conf.keygen.keygen_id, msg, sizeof(SECRET_MSG), BufferTx,
          MAX_APP_BUFFER_SIZE);

      Radio.Send((uint8_t *)packet, physec_packet_get_size(packet));
      break;
    }
    default:
      break;
    }
    Radio.Rx(RX_TIMEOUT_VALUE + random_delay);

    break;
  case TX_TIMEOUT:
    Radio.Rx(RX_TIMEOUT_VALUE + random_delay);
    break;
  default:
    break;
  }
}

static void OnledEvent(void *context) {
  UNUSED(context);
  LED_Toggle(LED_RED1);
  LED_Toggle(LED_RED2);
  UTIL_TIMER_Start(&timerLed);
}

void handle_user_button(void) {
  tm_plog(TS_OFF, VLEVEL_L, "> Restarting key generation\n\r");
  reset_handler(USER_BTN);
}

void reset_physec_states(bool first_reset) {
  if (!first_reset) {
    tm_plog(TS_ON, VLEVEL_M, "Performing Reset !\r\n");
  }
  update_physec_state(PHYSEC_STATE_PROBING);

  physec_key_num_bits = 0;

  RxBufferSize = 0;
  RssiValue = 0;
  SnrValue = 0;
  time_last_pp_send_all = 0;
  num_reg_rssis = 0;
  last_added_num_reg_rssis = 0;

  num_quantized_csi = 0;
  num_csi = 0;
  num_indexes = 0;
  probe_cnt = 0;
  num_remote_indexes = 0;
  quant_status = QUANT_STATUS_WAITING;

  num_csi_more = 0;
  num_quant_try = 0;

  post_process_expired = false;
  post_process_num_chunks_to_rx = 0;
  post_process_rx_chunks = 0;

  UTIL_MEM_set_8(&trigger_signals, 0, sizeof(trigger_signals));
  recon_num_try = 0;

  if (ecdh_state.enabled) {
    UTIL_MEM_set_8(&ecdh_state.keys, 0, sizeof(ecdh_state.keys));
    UTIL_MEM_set_8(&ecdh_state.session, 0, sizeof(ecdh_state.session));
    State = TX_FIRST_PROBE;
  } else if (physec_conf.keygen.is_master) {
    State = TX_FIRST_PROBE;
  }
  if (ecdh_state.enabled && !physec_conf.keygen.is_master) {
    /* if slave, compute pubkey here as he will not reenter with TX_FIRST_PROBE
     */
    generate_pub_priv_keys();
  }
}

/* USER CODE END PrFD */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF
 * FILE****/
